---
kind: type
id: T:Autodesk.Revit.DB.STLImportOptions
source: html/0e42500a-7595-5a1b-27e5-23ef168d1ebf.htm
---
# Autodesk.Revit.DB.STLImportOptions

The import options used to import STL format files.

## Syntax (C#)
```csharp
public class STLImportOptions : BaseImportOptions
```